Repository: 84000/data-translation-memory
Catalog: toh184-v2.tmx
Source language: bo
Languages: en

source: རིན་ཆེན་བྱིན་གྱིས་སྨྲས་པ། འདི་སྐད་ཅེས་སྨྲ་བར་བྱ་སྟེ།
en: Ratnadatta replied, “One should say the following:

source: འདོད་ཆགས་མ་སྤངས་
en: ‘Do not abandon desire.

source: ཤིག་ཞེ་སྡང་མ་གཞིལ་ཅིག །
en: Do not get rid of anger.

source: གཏི་མུག་མ་བསལ་ཅིག །
en: Do not clear away delusion.

source: རང་གི་ལུས་ལས་གྱེན་དུ་མ་བསྐྱོད་ཅིག །
en: Do not rise above the body.

source: མི་དགེ་བ་སྤྱོད་ཅིག །
en: Practice nonvirtue.

source: ལྟ་བ་ཚར་མ་གཅོད་ཅིག །
en: Do not vanquish views.

source: ཀུན་ཏུ་སྦྱོར་བ་རྣམས་མ་སྟོན་ཅིག །
en: Do not remove fetters.

source: ཕུང་པོ་རྣམས་ཡོངས་སུ་ཟུང་ཤིག །
en: Grasp at the aggregates.

source: ཁམས་རྣམས་རིལ་པོར་གྱིས་ཤིག །
en: Make the elements into a single mass.

source: སྐྱེ་མཆེད་རྣམས་ལ་སྤྱོད་ཅིག །
en: Engage the sense spheres.

source: བྱིས་པའི་ས་ལས་འདའ་བར་མ་བྱེད་ཅིག །
en: Do not go beyond the level of childish beings.

source: མི་དགེ་བ་ལ་རྟོགས་ཤིག །
en: Realize nonvirtue.

source: དགེ་བ་སྤོངས་ཤིག །
en: Abandon virtue.

source: སངས་རྒྱས་ཡིད་ལ་མ་བྱེད་ཅིག །
en: Do not contemplate the Buddha.

source: ཆོས་མ་སེམས་ཤིག །
en: Do not think about the Dharma.

source: དགེ་འདུན་ལ་ནི་མཆོད་པ་མ་བྱེད་ཅིག །
en: Do not make offerings to the Saṅgha.

source: བསླབ་པ་དག་ཡང་དག་པར་མ་ལེན་ཅིག །
en: Do not take up the trainings.

source: སྲིད་པ་ཉེ་བར་ཞི་བ་དོན་དུ་མ་གཉེར་ཅིག །
en: Do not strive to pacify existence.

source: ཆུ་བོ་ལས་མ་རྒལ་ཅིག །
en: Do not cross over the river.’

source: ཅེས་གདམས་ངག་འདི་ལྟ་བུས་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་གདམས་པར་བྱའོ། །
en: “It is with such instructions that one should instruct [and teach] beginner bodhisattvas.

source: རྗེས་སུ་བསྟན་པར་བྱའོ། །
en: [“It is with such instructions that one should instruct and] teach beginner bodhisattvas.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: ཆོས་རྣམས་ཀྱི་ཆོས་གནས་པ་འདི་ནི་གནས་པ་ཁོ་ན་ཡིན་པའི་ཕྱིར་རོ། །
en: Because only this state is the state of phenomena.

source: བྱིས་པ་དེ་དག་ནི་སྐྱེ་བའི་ཆོས་སུ་ལུང་སྟོན་པར་བྱེད་དོ། །
en: Childish beings declare that phenomena arise and

source: འགག་པའི་ཆོས་སུ་ལུང་སྟོན་པར་བྱེད་དོ། །
en: declare that phenomena cease.

source: ཆོས་ཀྱི་དབྱིངས་འདི་ནི་རྣམ་པར་མི་རྟོག་པས་རབ་ཏུ་ཕྱེ་བ་ཡིན་ཏེ།
en: The realm of phenomena is discerned through nonconceptuality.

source: ཆོས་འདི་རྣམས་ཀྱི་རང་བཞིན་དེ་ལྟར་རྗེས་སུ་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་བོ་ཞེས་དེ་ལྟར་གདམས་ན།
en: If someone receives the instruction that understanding the nature of phenomena in this way is awakening, and

source: གལ་ཏེ་མི་སྐྲག་མི་དངང་ཞིང་དངང་བར་མི་འགྱུར་ན།
en: if they are not afraid, scared, or frightened by it, then

source: ཀྱེ་མ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ནི་ཕྱིར་མི་ལྡོག་པ་སྟེ།
en: that person is a bodhisattva who will truly never regress.

source: ཕྱིར་མི་ལྡོག་པའི་སའི་སྐལ་བ་ཅན་ཡིན་ནོ་སྙམ་དུ་ཤེས་པར་བྱ་སྟེ།
en: That bodhisattva who has reached the stage free from regression should be considered a fortunate one.

source: གདམས་ངག་འདིས་ཡང་དང་ཡང་དུ་ཡང་དག་པར་དགའ་བ་བསྐྱེད་པར་བྱའོ། །
en: Through these instructions, one should give rise to true joy again and again.”

source: དེའི་ཚེ་དམིགས་པ་ཅན་གྱི་དགེ་སློང་བརྒྱད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མ་བསྟེན་པར་སྤངས་ནས་འཁོར་དེ་ནས་སོང་སྟེ།
en: At that point, eight monks who maintained the view of apprehension refused to follow this Dharma teaching, rejected it, and left the assembly.

source: ཁ་ནས་ཁྲག་དྲོན་མོ་བྱུང་ནས་ཤིའོ། །
en: They all vomited warm blood and died, and

source: ཤི་ནས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ངུ་འབོད་དུ་སྐྱེས་སོ། །
en: after they died they were reborn in the Great Wailing Hell.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At that point Mañjuśrī­kumāra­bhūta alerted the Blessed One saying,

source: བཅོམ་ལྡན་འདས་དགེ་སློང་དེ་དག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་པས་གནོད་པ་ཆེན་པོ་ཇི་ཙམ་དུ་གྱུར་པ་ལ་གཟིགས།
en: “Blessed One, see how those monks have suffered such great harm by listening to this Dharma teaching!”

source: འཇམ་དཔལ་ཁྱོད་དེ་སྐད་མ་ཟེར་ཅིག །
en: “Do not say such things, Mañjuśrī,” the Blessed One replied.

source: གལ་ཏེ་དགེ་སློང་འདི་དག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མ་ཐོས་སུ་ཟིན་ན།
en: “If these monks had not heard this Dharma teaching,

source: བསྐལ་པ་ས་ཡའི་བར་དུ་ནམས་ཀྱང་བཟང་འགྲོར་སྐྱེ་བར་ཡང་མི་འགྱུར་ན་སངས་རྒྱས་དང་ཕྲད་ཅིང་མཉེས་པར་བྱེད་པ་ལྟ་ཅི་སྨོས།
en: they would not have secured higher births for millions of eons, let alone meeting and serving any buddhas.

source: ད་ནི་དེ་དག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སོམ་ཉི་དང་བཅས་པས་ཐོས་ནས་ད་གཟོད་ཁོ་ནར་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ངུ་འབོད་ནས་ཤི་འཕོས་ཏེ་དགའ་ལྡན་གྱི་ལྷའི་རིས་སུ་སྐྱེའོ། །
en: Since they just listened to this Dharma teaching with doubt, they are right now dying and transmigrating from the Great Wailing Hell and being reborn among the gods in the Heaven of Joy.

source: དེ་དག་བསྐལ་པ་དྲུག་ཅུ་རྩ་བརྒྱད་ཀྱི་བར་དུ་དེ་བཞིན་གཤེགས་པ་ཁྲག་ཁྲིག་ཕྲག་བཅུ་མཉེས་པར་བྱེད་པར་འགྱུར་ཏེ།
en: For sixty-eight eons, they will serve billions of thus-gone ones.

source: ཐམས་ཅད་དུ་རྫུས་ཏེ་སྐྱེ་ཞིང་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཤ་སྟག་ཏུ་འགྱུར་ལ།
en: In all these lives they will only take miraculous birth and become universal monarchs.

source: བསྐལ་པ་གཅིག་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དྲི་མ་མེད་པའི་འོད་ཅེས་བྱ་བ་དག་ཏུ་འགྱུར་རོ། །
en: In a later eon they will become thus-gone ones, worthy ones, perfect complete buddhas known as Vimalaprabhāsa.”

source: དེ་ནས་ལྷའི་བུ་དེ་དག་གིས་བདག་ཅག་ལུང་བསྟན་པ་ལྷའི་རྣ་བའི་ཁམས་ཀྱིས་ཐོས་ནས།
en: Then, having heard the prophecy with their divine hearing,

source: དེ་དག་ལྷའི་བུ་བརྒྱད་ཁྲི་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས་
en: those gods, together with eighty thousand gods, traveled to where the Blessed One was.

source: ལྷའི་མེ་ཏོག་གིས་ཡངས་པའི་གྲོང་ཁྱེར་ཐམས་ཅད་དུ་གཏོར་ཏོ། །
en: When they arrived, they scattered divine flowers all over Vaiśālī.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་ཡང་རྗེས་སུ་ཡི་རང་སྟེ།
en: They rejoiced in this Dharma teaching, saying,

source: བཅོམ་ལྡན་འདས་བདག་ཅག་རྗེས་སུ་ཡི་རང་ལགས་སོ། །
en: “Blessed One, we rejoice!

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བྱང་ཆུབ་ཀྱི་ཚུལ་འཕེལ་བར་མཛད་དུ་གསོལ་ཞེས་ཀྱང་གསོལ་ཏོ། །
en: Please cause the system of the awakening of the thus-gone ones to flourish!”

source: དེ་དག་རྗེས་སུ་ཡི་རང་བའི་མོད་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: The moment that they rejoiced in this way, they became irreversible from unsurpassed and perfect awakening.

source: ཡངས་པའི་གྲོང་ཁྱེར་ཆེན་པོའི་སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: Eighty-four thousand beings of the great city of Vaiśālī also became irreversible from unsurpassed and perfect awakening.

source: སྲོག་ཆགས་ཁྲི་ཉིས་སྟོང་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ། །
en: Twelve thousand beings removed the dust from the Dharma eye that sees all phenomena, rendering it stainless and pure.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One continued to address Mañjuśrī­kumāra­bhūta, saying,

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་བསྐལ་པ་འབུམ་གྱི་བར་དུ་ཐབས་ལ་མཁས་པ་མེད་པར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པ་བས། གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སོམ་ཉི་དང་བཅས་པས་ཐོས་ནའདི་ནི་དེ་བས་ཆེས་བསོད་ནམས་མང་དུ་སྐྱེད་ན་གང་གིས་སོམ་ཉི་མེད་པར་ཐོས་པ་ལྟ་ཅི་སྨོས།
en: “Mañjuśrī, since someone who listens to this Dharma teaching with doubt generates far greater merit than a bodhisattva who practices the six perfections without skillful means for one hundred thousand eons , why mention someone who has no doubt when they hear it?

source: གང་གིས་ཡི་གེར་འདྲི་བ་དང་། ལུང་ནོད་པ་དང་། འཆང་བ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་སྟོན་པ་ལྟ་ཅི་སྨོས།
en: And why mention those who write it down, explain it, hold it, and teach it extensively to others?

source: འཇམ་དཔལ་དེ་ལྟ་བས་ན་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་པར་འདོད་པས་ཀྱང་ཆོས་འདི་ལ་བསླབ་པར་བྱའོ། །
en: Therefore, Mañjuśrī, those who want to attain the state of a worthy one should train in this teaching,

source: རང་བྱང་ཆུབ་ཐོབ་པར་འདོད་པས་ཀྱང་ཆོས་འདི་ལ་བསླབ་པར་བྱའོ། །
en: those who want to attain the state of a solitary buddha should train in this teaching, and

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཀྱང་ཆོས་འདི་ལ་བསླབ་པར་བྱའོ། །
en: those who want to become a complete buddha who manifests unsurpassed and perfect awakening should train in this teaching.”

source: དེ་ནས་ཁྱེའུ་རིན་ཆེན་བྱིན་གྱིས་རང་གི་མ་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The boy Ratnadatta then said to his mother,

source: མ་མ་ཁོ་བོ་ལ་ཁ་ཟས་བྱིན་ཅིག་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་ཟས་དབུལ་བར་བྱའོ། །
en: “Mother, please give me some food, and I will offer it to the Blessed One.”

source: དེ་ནས་ཁྱེའུ་རིན་ཆེན་བྱིན་གྱི་མ་མས་ཁར་བའི་སྣོད་ཟས་རོ་བརྒྱ་དང་ལྡན་པས་བཀང་སྟེ། ཁྱེའུ་རིན་ཆེན་བྱིན་ལ་བྱིན་ནོ། །
en: Ratnadatta’s mother filled a metal bowl with delicious food and gave it to the child.

source: དེ་ནས་ཁྱེའུ་རིན་ཆེན་བྱིན་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Ratnadatta then addressed the Blessed One, saying,

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་མི་ཟད་པའི་བདེན་པ་གང་ལགས་པའི་བདེན་པ་དེས་ན་དགེ་སློང་གི་དགེ་འདུན་ཐམས་ཅད་ཚིམ་པར་མ་གྱུར་གྱི་བར་དུ་ཁར་བའི་སྣོད་འདི་ཡོངས་སུ་འགྲིབ་པར་མ་གྱུར་ཅིག །
en: “Blessed One, since it is true that all phenomena are inexhaustible, may the food in this metal bowl not diminish until the entire saṅgha of monks has been satisfied.”

source: དེ་ནས་ཁྱེའུ་རིན་ཆེན་བྱིན་གྱིས་བཅོམ་ལྡན་འདས་ཀྱི་ལྷུང་བཟེད་བཀང་ནས་
en: Ratnadatta filled the Blessed One’s alms bowl first and then addressed the saṅgha of monks, saying,

source: དགེ་སློང་གི་དགེ་འདུན་ལ་སྨྲས་པ། བཙུན་པ་རྣམས་བདག་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་གང་གིས་བདག་ལ་འབྲས་བུ་ཆེན་པོར་འགྱུར་བའི་བསོད་སྙོམས་འདི་བཞེས་ཏེ
en: “Venerable Ones, may these alms be accepted out of compassion for me by someone who can ensure that I obtain a great result.

source: གང་ལུས་ཀྱིས་ཡོན་སྦྱོང་བར་མི་བྱེད་པ་དང་། སེམས་ཀྱིས་སྦྱོང་བར་མི་བྱེད་པ་དང་།
en: May these alms be accepted by someone who does not purify the gift with the body, who does not purify it with the mind;

source: གང་ལ་ཕུལ་ན་བསོད་ནམས་སུ་མི་འགྱུར་བ་དང་། རྣམ་པར་སྨིན་པར་མི་འགྱུར་བ་དང་།
en: someone who will not generate merit or ripen karma when it is offered to them;

source: གང་ལུས་ཀྱི་ལས་དང་། ངག་གི་ལས་དང་། ཡིད་ཀྱི་ལས་དང་མི་ལྡན་པ་དང་། །
en: someone who has no physical, verbal, or mental karma;

source: གང་འདུས་བྱས་ལ་མི་གནས་པ་དང་། གང་འདུས་མ་བྱས་ལ་མི་གནས་པ་དང་།
en: someone who abides neither in the conditioned nor in the unconditioned;

source: གང་སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་ཀྱིས་མ་གོས་པ་དང་།
en: someone who is not stained by the qualities of ordinary beings;

source: ཉན་ཐོས་ཀྱི་ཆོས་རྣམས་ལ་མི་རྟེན་པ་དང་།
en: someone who does not rely upon the teachings of the hearers;

source: སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ངེས་པར་མི་འབྱུང་བ་དང་།
en: someone who is not skilled in the vehicle of the buddhas;

source: ངེས་པར་འབྱུང་བར་མི་འདོད་པ་དེས་བཞེས་ཤིག །
en: and someone who has no wish to be skilled in it!”

source: དེ་ནས་དགེ་སློང་གི་དགེ་འདུན་དེ་དག་གི་ནང་ནས་སུས་ཀྱང་སྣོད་དེ་མ་བླངས་སོ། །
en: No one in the saṅgha of monks took up the bowl,

source: ཁྱེའུ་རིན་ཆེན་བྱིན་གྱིས་སྨྲས་པ། བཙུན་པ་དག་བདག་ཀྱང་སྦྱིན་པར་འདོད་པ་ལགས། ཁྱེད་ཀྱང་གསོལ་བར་བཞེད་པ་ལགས་ཏེ།
en: so the child Ratnadatta continued, “Venerable Ones, I wish to make a gift, and you also wish to eat.

source: བདག་བཙུན་པ་རྣམས་ལས་ཅི་ཡང་རེ་བ་མ་མཆིས་ཀྱི་བཞེས་ཤིག །
en: I do not expect anything in return from you venerable ones, so please eat!

source: འཇམ་དཔལ་གྱི་ཚད་དང་མཉམ་པའི་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་འབུམ་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དེ་བས་ཀྱང་ཆེས་བྱེ་བ་ཕྲག་འབུམ་ལས་ལྷག་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ།
en: If it is true that my buddha realm will have a display of qualities that is a billion times greater than the display of qualities present in the buddha realms of billions of bodhisattvas who are of the same stature as Mañjuśrī, and

source: བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྱུར་བའི་བདེན་པ་དང་བདེན་པའི་ཚིག་གང་ཡིན་པའི་བདེན་པ་དང་བདེན་པའི་ཚིག་དེས་ན་ཁར་བའི་སྣོད་འདི་ལས་ཁྱེད་ཐམས་ཅད་ཀྱི་ལྷུང་བཟེད་རྣམས་གང་བར་གྱུར་ཅིག །
en: if it is true that what I have spoken is the truth, then by these true statements may all your bowls be filled from this metal bowl, and

source: ཁར་བའི་སྣོད་འདི་ཡང་ཡོངས་སུ་ཟད་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: may this bowl never be emptied!”

source: དེ་ནས་དགེ་སློང་གི་དགེ་འདུན་ཐམས་ཅད་ཀྱི་ལྷུང་བཟེད་དེ་དག་གང་བར་གྱུར་ཏོ། །
en: All the alms bowls of the saṅgha of monks were then filled.

source: དེ་ནས་ཁྱེའུ་རིན་ཆེན་བྱིན་གྱིས་ཡངས་པའི་གྲོང་ཁྱེར་གྱི་སྐྱེ་བོའི་ཚོགས་ཇི་སྙེད་ཡོད་པ་ཐམས་ཅད་ཁ་ཟས་རོ་བརྒྱ་དང་ལྡན་པ་དེས་ཚིམ་པར་བྱས་སོ། །
en: The child Ratnadatta fed the entire population of Vaiśālī with delicious food, and

source: བསོད་སྙོམས་དེ་ཡང་ཟད་པར་མ་གྱུར་ཏོ། །
en: even then the alms did not run out.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱེའུ་རིན་ཆེན་བྱིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Then the Blessed One addressed the child Ratnadatta, saying,

source: རིན་ཆེན་བྱིན་ལྔ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཡོངས་སུ་སྦྱོང་བ་སྟེ།
en: “Ratnadatta, these five are a bodhisattva’s purification of a gift:

source: ལུས་མི་དམིགས་པ་དང་། སེམས་མི་དམིགས་པ་དང་། སྦྱིན་པ་ལ་མངོན་པར་ཞེན་པ་མེད་པ་དང་། རྣམ་པར་སྨིན་པ་མི་འདོད་པ་དང་། ལེན་པ་པོ་རྣམས་ལ་རྣམ་པར་སྨིན་པ་མེད་པའོ། །
en: not apprehending a body, not apprehending a mind, having no attachment to the gift, not desiring any ripening, and no ripening for the recipients.

source: རིན་ཆེན་བྱིན་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔས་རྟག་ཏུ་མངོན་དུ་བྱ་བ་སྟེ།
en: Moreover, Ratnadatta, a bodhisattva should always manifest the following four things:

source: སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་དང་། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། བདག་གི་ལས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: the meditative concentration of emptiness, recollecting the Buddha, great compassion, and the ripening of one’s own karma.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One addressed Mañjuśrī­kumāra­bhūta, saying,

source: འཇམ་དཔལ་ཁྱེའུ་རིན་ཆེན་བྱིན་འདི་བསྐལ་པ་སུམ་ཅུ་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: “Mañjuśrī, in thirty eons, this child Ratnadatta will become a complete buddha who has manifested unsurpassed and perfect awakening.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྟོབས་དང་གྲགས་པ་དོན་ཡོད་པ་ཞེས་བྱ་བར་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །
en: He will appear in the world as a thus-gone one, a worthy one, a perfect buddha, learned and virtuous, a blissful one, a knower of the world, an unsurpassed charioteer who tames beings, a teacher of gods and humans, a blessed buddha called Amogha­bala­kīrti.

source: དེའི་འཁོར་དུ་འདུས་པ་ཡང་མཐའ་ཡས་པར་འགྱུར་ཏེ།
en: Those who gather in his retinue will be infinite in number, and

source: ཐམས་ཅད་ཀྱང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཤ་སྟག་གོ། །
en: all of them will be bodhisattvas who do not regress.

source: དེ་དག་ཀྱང་འོད་མཐའ་ཡས་པ་དང་། ཚེ་དཔག་ཏུ་མེད་པར་འགྱུར་རོ། །
en: They will be infinitely radiant and have immeasurable lifespans.”

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས།
en: “Blessed One, what is the name of this Dharma teaching?

source: འདི་ཇི་ལྟར་གཟུང་བར་བགྱི།
en: How should it be remembered?”

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བསྟན་པ་ཞེས་བྱ་བར་ཟུང་ཤིག །
en: “You should remember it as Teaching the Practice of a Bodhisattva, or

source: ཆོས་ཉིད་ཀྱི་སྐྱེ་བོ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །
en: you can also remember it as A Being Born from Reality.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་བསོད་སྙོམས་བཞེས་ནས་གཤེགས་སོ། །
en: After the Blessed One and the saṅgha of monks had eaten their alms they went on their way, and

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: after the Blessed One had said this,

source: བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་བྱིན་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: the bodhisattva Ratnadatta, the entire retinue, and the world with its gods, humans, asuras, and gandharvas rejoiced and praised the Blessed One’s words.

source: འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This concludes the noble Great Vehicle sūtra “Teaching the Practice of a Bodhisattva.”

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། པྲཛྙཱ་ཝརྨ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེ་ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།། །།
en: It was translated, edited, and finalized by the Indian scholars Jinamitra and Prajñāvarman and the chief editor-translator Bandé Yeshé Dé and others.
